#include <stdio.h>
#include <math.h>                                   // รวมไลบรารี math.h เพื่อใช้ฟังก์ชัน fmod

int main() {
    int a = 5, b = 17;               // ประกาศตัวแปร int
    float c = 8.5, d = 4.0;     // ประกาศตัวแปร float        

    printf("ค่าตามที่ทั้งหมด a=%d b=%d c=%.1f d=%.1f\n", a, b, c, d);       // แสดงค่าตัวแปรทั้งหมด
    printf("ผลการคำนวณของ d + a = %.1f\n", d + a);                     // แสดงผลการคำนวณของ d + a   ค่า 4.0 + 5 
    printf("ผลการคำนวณของ a - b = %d\n", a - b);                       // แสดงผลการคำนวณของ a - b   ค่า 5 - 17          
    printf("ผลการคำนวณของ c * d = %.1f\n", c * d);                    // แสดงผลการคำนวณของ c * d   ค่า 8.5 * 4.0
    printf("ผลการคำนวณของ a * c = %.1f\n", a * c);                    // แสดงผลการคำนวณของ a * c   ค่า 5 * 8.5
    printf("ผลการคำนวณของ c / d = %.1f\n", c / d);                   // แสดงผลการคำนวณของ c / d    ค่า 8.5 / 4.0    
    printf("ผลการคำนวณของ c / d = %.1f\n", b / c);                   // แสดงผลการคำนวณของ b / c    ค่า 17 / 8.5          
    printf("ผลการคำนวณของ a %% b = %d\n", a % b);                    // แสดงผลการคำนวณของ a % b    ค่า 5 % 17   
    printf("ผลการคำนวณของ fmod(c, a) = %.1f\n", fmod(c, a));         // ผลการคำนวณของ fmod(c, a) (ใช้ fmod แทน % สำหรับ float)  
    printf("ผลการคำนวณของ fmod(c, d) = %.1f\n", fmod(c, d));         // ผลการคำนวณของ fmod(c, d) (ใช้ fmod แทน % สำหรับ float)

    return 0;
}